Repository: mozilla-l10n/mt-training-data
Catalog: eko/eko_pontoon.tmx
Source language: en_us
Languages: eko

source: 1 sentence collected
eko: Naxhuma farazi moote

source: 2 down, keep it up!<playIcon></playIcon>
eko: Pontu piiri <playIcon></playIcon> , mwirutele etthiipi!

source: About
eko: Hapari

source: Accepted file types: .tsv only
eko: Tiipu za marikiivu antakhiwaye: so .tsv

source: { $actionType }<playIcon></playIcon> did they accurately speak the sentence?
eko: { $actionType }<playIcon></playIcon> Faraazi yalupiwa saaneene?

source: { $actionType }<recordIcon></recordIcon> then read the sentence aloud
eko: { $actionType }<recordIcon></recordIcon> mwisome farazi na huula yoosileya

source: { $actionType }<stopIcon></stopIcon> when done
eko: { $actionType } <stopIcon></stopIcon> na wiixha

source: { $actionType } submit when ready
eko: { $actionType } Mperekhe mmana mwiixixa

source: Add and Review Sentences, Add Questions, Transcribe Audio
eko: Wekezele ni orutele osoma farazi, wekezela zawuzela, omatikha ayutiyu.

source: Add <icon></icon> a public domain sentence
eko: Wekezela <icon></icon> farazi moote ancuwaaye atthu awaatta

source: Add information
eko: Wekezela hapari

source: Add new sentences for the community to read
eko: Mweekezele farazi pheeya yoori esomiwe okomunitaati

source: Add one sentence per line
eko: Khula liinya weekezele na farazi moote

source: Add questions
eko: Mweekezele zawuuzela na luuka yeenu

source: Add sentences
eko: Mweekezele farazi na luuka yeenu

source: Add Sentences
eko: Mwekezele farazi

source: Add up to 1,000 sentences
eko: Mwekezele mpakha farazi alufu

source: Add Your Voice
eko: Muthevo huula yenu

source: Agriculture and Food
eko: Malimelo ni macelo

source: All sentence must have the same domain
eko: Farazi zooxhi zinaye olupa vithu zoolattana

source: All sentences must have the same citation
eko: Farazi zooxhi zinaye wiiyana ocitariwa mananna mamote

source: Already have an account? <login>Log-In</login>
eko: Mwiinawe kootha?<login>Nvire</login>

source: An error occurred fetching sentences
eko: Neettelaka othula farazi yavonyeya etthu.

source: An error occurred reviewing this sentence
eko: Neettelakha orevizari farazi yavonyeya etthu.

source: An error occurred submitting your voice information
eko: Yavonyeya nitakhaka winviyari hapari za huula

source: Approve
eko: Yaaporovari

source: A quiet background hubbub is OK, but we don’t want additional voices that may cause a machine algorithm to identify words that are not in the written text. If you can hear distinct words apart from those of the text, the clip should be rejected. Typically this happens where the TV has been left on, or where there is a conversation going on nearby.
eko: Waapa ontaye petiwele ori saana, masi khanintakha huula sikiina sinttelawe yoori alokoritimu wa makina zoonele moolumo sihiyeni ntextu sawaatikhiwa. Mmana okhitiri osiila moolumo oovirikana ya textu, nnaye okatthala kiliipi. Epo siirettikhana mmana elikhiwa TV yoolikariwa wala nipuro kharipu onttakhuliwayevo.

source: Are you coming? <strong>[called by another]</strong>
eko: Weeyo ontta ota? <strong>[okhuweliwa na nkina]</strong>

source: Ask us questions on <matrixLink>Matrix</matrixLink>, <discourseLink>Discourse</discourseLink> or <emailLink>email</emailLink>.
eko: Munuuzele <matrixLink>Matrix</matrixLink>, <discourseLink>Ottakhula</discourseLink> wala ni <emailLink>email</emailLink>.

source: Automotive and Transport
eko: Ayutumotivu ni taranxiporiti

source: Background Noise
eko: Onyakula yookutokuto

source: Background Voices
eko: Huula zooxhini

source: Be cautious before rejecting a clip on the ground that the reader has mispronounced a word, has put the stress in the wrong place, or has apparently ignored a question mark. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a margin of appreciation for those who may speak differently from you.
eko: Muhinaaze onyaari kilipi muunaye wekesa saanene moone nkhama yoori namasoma khasomeeni saana, attitthimisa vahale vohiwi attapho wala khacaleeni pontu yahuzela. Tuniya sooxhi enaaye manannaya olupa moolumo, makina pooti yoori khunaaze osiila tuuniya yawo. Nwattitthimise apale anttakhulawe luuka soovirikana neetile onttakhulaye weeyo.

source: [‘Beret’ is OK whether with stress on the first syllable (UK) or the second (US)]
eko: Yarufu soohivume siittakhuliwa oParazili (rapasi, kofiyo), masi wala Oportukaali (rapasi, kofiyo).

source: <bold>{ $count }</bold> Clips
eko: <bold>{ $count }</bold> Ikiliipi

source: <bold>Help us</bold> find more voices
eko: <bold>Nnajutari</bold> Osikana huula kiina

source: Bulk batch
eko: Nikhuru noowula

source: Bulk Sentences Uploaded
eko: Nikhuru za farazi zawiiviyariwa.

source: By telling us about yourself, you will help developers build more inclusive technology
eko: Mwiitakha onuuza hapari wa mananna mwinttakhulazo?

source: By using Common Voice, you agree to our <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
eko: Na huula za atthu <termsLink>Mananna wokhola</termsLink> ni <privacyLink>Politika za privasitaatti</privacyLink>

source: Cancel Re-recording
eko: Okatthala orutela okaravari

source: Cancel Submission
eko: Okhattaza winviyari

source: Cannot submit more than 1000 sentences
eko: Khintakheya winviyari farazi zoovikana alufu

source: Change preferences
eko: Ovirikanisa sootakheya

source: Check <icon></icon> is this a linguistically correct sentence?
eko: Moonesesa<icon></icon> nkhama farazi yaatikhiha saanene?

source: <chevron></chevron>See less
eko: <chevron></chevron>Woona vattitthiru

source: <chevron></chevron>See more
eko: <chevron></chevron>Woona sawaatta

source: Citation
eko: Yoolupiwa

source: Cite with a URL link or the full name of the work.
eko: Nsitari na link URL wala nzina looxi ya liivuru.

source: Click
eko: Ntthitte

source: Clips Uploaded
eko: Karavasayu zootthepiwa

source: Comment
eko: Zawekezela

source: Contact Us
eko: Nnittakhulane

source: Continue
eko: Orutela

source: Continue validating
eko: Oruttela ovalitari.

source: Contribute
eko: Mutane vithu zenu

source: Contribute sentences
eko: Mwajutari na farazi.

source: Contribution Criteria
eko: Tarikhi zoovira za nsokho

source: Create a profile
eko: Nkiriyari perfili

source: Criteria
eko: Tarikhi soovira

source: Datasets
eko: Nikhuru wa taatu

source: Delete my recordings
eko: Ofhuca karavasayu zaka

source: Different language
eko: Luuka soovirikana

source: Difficult to pronounce
eko: Yoolipa olupa

source: Discard ongoing recording
eko: Okathala karavasayu yawettetta

source: Does the sentence meet the guidelines?
eko: Farazi enlottisela tarikhi?

source: Donate your voice
eko: Mwiikhe huula yenu

source: Don't see your language on Common Voice yet?
eko: Luuka yeenu nalelo kinatthiwemo huula yaatthu awaatta

source: Drag your file here or <uploadButton>click to upload</uploadButton>
eko: Arkivu awu ompurulele okhuno <uploadButton>otthithe para omwinviyari</uploadButton>

source: Drop file here to upload
eko: Arkivu awu ompurulele okhuno para omwinviyari

source: Enter your public domain sentence here
eko: Mwitigitari apha farazi ancuwaaye atthu awaatta

source: Enter your public domain sentences here
eko: Mwitigitari apha farazi ancuwaaye atthu awaatta

source: Error adding sentence
eko: Yaapatikhana faalya yekezelika farazi

source: Exit & Delete clips
eko: Osaruwa ni ofuca farazi

source: Fewer than 15 words per sentence
eko: Zoohifyiyeli mattakhuzi khumi na thunu

source: File is too large
eko: Arikivu khastaweeni owuula

source: File is too small
eko: Arikiivu khastaweeni opuxuwa

source: Finance
eko: Finansa

source: Finish recording
eko: Wiixixa karavasayu

source: Finish recording first?
eko: Mwaaze wiixixa karavasayu

source: Finish Review
eko: Wiixixa oruttela woona

source: Finish validating
eko: Wiixha ovalitari

source: Finish validating clips?
eko: Wiixha ovalitari kiliipi?

source: Follow guidelines from “What sentences can I add?”
eko: Mwilotte tarikhi “Keekezele na farazi piivi?”

source: for example
eko: Nthonyeryo

source: For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. For example, if we don't include any speakers with a particular accent, then the technology won't work well for people with that accent. <learnMore>Learn more about why metadata matters.</learnMore>
eko: Para yoori tekonologiya ziwarumeele atthu oxhi, taatu ziniwajutaraaye apale apakaye tekonologiya zinaaye woonisela vitthu soovirikana za atthu. Moniheryo, mmana muhiitthiimo ntthu antakhulaye luuka yoocuweya(sotaakhi), tekonologiya khinlawa okhola khaazi para ntthu otule onttakhulawe luuka eto (sotaakhi).<learnMore>Ncuwelele importansiya ya metadados</learnMore>

source: General
eko: Gerali

source: General language / multiple variants
eko: Luuka gerali /luuka zawiyana mattakhulelo awaatta

source: Grammatical / spelling error
eko: Yoovonyiwa manaana yaatikhiwa

source: Great!<recordIcon></recordIcon> Record your next clip
eko: Oxhapweya saaneene! <recordIcon></recordIcon>Nkaravari farazi enlottanaye

source: Great work!<playIcon></playIcon> Listen again when you're ready
eko: Mukhoole saana khaazi! <playIcon></playIcon> Muusile thennya mmana mucitthokisa.

source: Guidelines
eko: Tarikhi zooxhapweya ovira.

source: Healthcare
eko: Ekumi

source: Help create Common Voice’s first target segment in { $locale }
eko: Waajutari oretta khazizetthu soomwanzo osilezaka huula weetthu { $locale }

source: Help us validate voices
eko: Munaajutari ovalitari huula

source: His hand was rais-ed.
eko: Nkhono enu walankha.

source: History, Law and Government
eko: Hantisi, haakhi e Nfhalume

source: How do I cite?
eko: Nisitari toovi?

source: How to add multiple sentences
eko: Kekezele toovi na farazi zawaatta

source: How would you describe your sex or gender?
eko: Mwaatikha toovi sexu wala generu?

source: I agree
eko: Kakhupali

source: I confirm that these sentence are <wikipediaLink>public domain</wikipediaLink> and I have permission to upload them.
eko: Kakhupali yoori farazi eti ti<wikipediaLink> yoocuwiwa ni atthu awaatta</wikipediaLink>ni katakhisiwa para wiiviari.

source: I confirm that this sentence is <wikipediaLink>public domain</wikipediaLink> and I have permission to upload it.
eko: Woone saana nkhama farazi eti <wikipediaLink>ti yoocuwiwa ni atthu awaatta</wikipediaLink>ni katakisiwa yoori kiperekhe.

source: <icon></icon> Add multiple public domain sentences
eko: <icon></icon> Mweekhezele farazi zikina ancuwaye atthu awaatta

source: Ideally natural and conversational (it should be easy to read the sentence)
eko: Farazi enaaye wiiya yookheya osoma

source: I do not agree
eko: Akinkhupali

source: If it’s your own words, just say <italicizedText>“Self Citation”</italicizedText>. We need to know where you found this content so that we can check it is in the public domain and no copyright restrictions apply. For more information about citation see our <guidelinesLink>Guidelines page</guidelinesLink>.
eko: Moolumo mwaatikhiweyo yeyaru mattakhuzeenu, nsalaru olupa <italicizedText>“awutusitasayu”</italicizedText>Nintakha ocuwa vahale mpatthiyeevo moolumo para yoori noone nkhama atthu awaatta ancuwa ni khinkhattaziwa ni apale attikhiye. <guidelinesLink>Weekese hapari zikina za sitasayu </guidelinesLink>mpagina mweetthu ziriimo tarikhi zooxhapweya ovira</guidelinesLink>.

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
eko: Karavasayu mmana ehettimo wala yiiyana estalu, okathale, ehiyaru yooru textu nalelu ensileya yooxhi.

source: If there is additional information you want to provide about this file, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
eko: Mmana ziyavo hapari yawekezela mwarutakhawe onuuza sopere arkivu otu, nnittakhulane ni<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If there is additional information you want to provide about this file that is not included in the template, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
eko: Mmana ziyavo hapari yawekezela mwarutakhawe onuuza sopere arkivu otu, ehiteeni vamote ni epile sotakisiwa ,nnittakhulane ni<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
eko: Farazi mmana ehitana tarikhi zooxapweya ovira nkhama epile zaatikhile otulu, nthitthe potayu &quot; Okathala &quot; latu eskereta. Mmana moona woori khamuujuwa saana, mweeyo poti wiirukha khulawa enlottanaye.

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
eko: Mmana farazi etana tarikhi zooxapweya ovira, nthitthe potayu &quot; waporovari &quot; eri tireyita.

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
eko: Mmana musikana vitthu sootikinisa, muthawule manaana muncuwaye. Mmana moocela otisitiri, ntaphunye pitayu enlupaye wiirukha meetele karavasayu enlotanaaye.

source: If you run out of sentences to review, please help us collect more sentences!
eko: Walani, mmana ihiyeni farazi para oruttela yoona, munajutari otana farazi sikina!

source: Include appropriate citation
eko: Onlupa hapara zoonxhi ni zooxhapwela mwa ennyewe atikhiye livuru

source: Invalid file
eko: Arikivu khankhola khaazi

source: It contains words or phrases that are hard to read or pronounce.
eko: Yee enaaye mattakhuzi wala linya soolipa osoma wala olupa

source: It is written in a language different than what I’m reviewing.
eko: Yaatikhiwa luuka kiina yoovirikana etile kiirevisaraye.

source: It is written in a language different than what I’m speaking.
eko: Yee watikhiwa luuka yoovirikana yoolikha eti kinlupaye.

source: Just Unsure?
eko: Khuroromeleeni saana?

source: Keep it up, record again <recordIcon></recordIcon>
eko: Nrutele etthiipo, ikaravari thennya<recordIcon></recordIcon>

source: Keep the recordings
eko: Osuka karavasayu

source: Keep track of your progress with a profile
eko: Mulottelele owulaweno mperifili mwenu

source: Language Fundamentals (e.g. Digits, Letters, Money)
eko: Ifuntamento ya linkwagem (nthoonyero, itígito, harufu, nzurukhu)

source: Languages
eko: Luuka

source: Large bulk sentence submission
eko: Operekha nikhuru na farazi

source: Learn More
eko: Mucuwe vawatta

source: Leaving now means you'll lose your progress
eko: Mmana mwemela nasaapi ziinttela owaxikhani khazi zooxi

source: Listen
eko: Osiila

source: Listen options menu
eko: Menu za vitthu sawattikhiwa

source: Loading sentences…
eko: Othuula farasz...

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
eko: <loginLink>Mwiivire nkotha mwenu</loginLink> wala <loginLink>ikiriyari moote</loginLink> para weekezela farazi zawaatta

source: Log in or sign up to get started
eko: Mwivire wala ncittokise para waaza

source: Log In / Sign Up
eko: Ovira/ ochitthokise

source: Make sure the sentence meets the following criteria:
eko: Onaaye olipiserya yoori farazi ziiyane wiiyana tarikhi zooxapweya ovira nkhama epi ninlottaye:

source: Maximum file size: 25 MB
eko: Mawulelo awixela owula ya arikivu: exhiriini na thaanu MB

source: Media and Entertainment
eko: Mitiya ni ohakalala

source: Minimum sentences in file: 1000
eko: Nuumero ntitthiru na farasi mmwarikivu: alufu

source: [Mismatched content]
eko: [Viithu ipi khinlikana]

source: Misreadings
eko: Ohijuwelela saana osoma

source: Missing an <strong>'s'</strong> at the end of a word.
eko: Khina <strong>'s'</strong>enixhelaaye nttakhusi .

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
eko: Khina<strong>'Moote'</strong> Wala <strong>'O'</strong> . Yaazaka karavasayu

source: Missing the end of the last word by cutting off the recording too quickly.
eko: Karavasawu khahiixheeni mpakha pontha, mwaasa yeetta wakuva ofyukiwa

source: [More has been recorded than the required text]
eko: [Sakaravariwa textu soochira epile sintakhiwaye]

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
eko: Karavasayu sawaatta ti saatthu apale anttakhulawe luuka saamutimwaya. Mweeyo pooti okhupaleela karavasayu sohilikani na sikina zeyaru zoonyakuleliwa, zawapiwa wala epile soottakhuliwa na huula yooxhapweya. Mukathale karavasayu epile zaawipiwa ni zawiyana huula soopakiwa nkomputatore.

source: Nature and Environment
eko: Tuniya nivitthu zooxhi zamolumweeku

source: News and Current Affairs
eko: Hapari ya nasaapi

source: No
eko: Wala

source: [No ‘a’ in the original text]
eko: [Khina ‘monte’ texto yamwanzo]

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
eko: <noCopyright>Yohikhattaziya ni ennyewe awatikha</noCopyright> (cc-0)

source: No foreign letters
eko: Khina harufu za tuniya kiina

source: No microphone found.
eko: Khisikaniyeeni nne mikorofooni.

source: No numbers and special characters
eko: Khina manummero wala harufu za tuniya kiina

source: No sentences to review. <addLink>Add more sentences now!</addLink>
eko: Khiivo farazi para orutela woona. <addLink>Mwekezele farazi nasaapi!</addLink>

source: No thanks, continue speaking
eko: Wala, khaxukhuru, orutela nttakhulo

source: Offensive language
eko: Mattakhuzi oveyisa

source: Offensive speech
eko: Mattakhuzi oveyisa

source: On desktop devices you can contribute by downloading…
eko: Nkomputatoore, mweeyo poote opaxari yanasaapi:

source: On his head he wore a beret.
eko: Rapasi awaliye kofiyo.

source: On iOS please continue with Safari to enable recording…
eko: iOS, orutele ni Safari para waativari karavasayu…

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
eko: Kiina, moonaru yoori namasoma khanaaze woona noolumo wala khancuwa ottakhula saaneene, munyaari. Mmana ihicuwi saana, mwiirukhe.

source: p
eko: r

source: Partner
eko: Nxirikha

source: [Part of the text can’t be heard]
eko: [Ehisiliwe textu ya parti kiina]

source: <playIcon></playIcon>Last one!
eko: <playIcon></playIcon> Wiixela!

source: Play/Stop
eko: Ovuma / Weemela

source: Please check our <templateFileLink>template file</templateFileLink>. Your sentences should be copyright free (CC0 or permissioned original work by the submitter) and be clear, grammatically correct and easy to read. Submitted sentences should take roughly 10-15 seconds to read and should avoid including numbers, proper nouns and special characters.
eko: Mmoone<templateFileLink>arikivu etthu wa motelu</templateFileLink>. Farazi zenu zinaye wiiya zoohikhattaziwa na ennyene atikiye (lisensa CCzero wala khaazi ya mwaazo zawawutorizariwa ni apale apakiyeeyo ) ni yiiye yoocuweya, yohivonyeyi ni yoohivili osoma. Farazi zawinviyariwa zinawe wiiyana sekuntu khumi ni khumi na thaanu para osomiwa. ni enaaye wiivitari otakanisa manuumeru, mazina ni harufu ipile sihiri ntekelatu(masi mmana zithitthuwa tekalatu piiru hoora mmote).

source: Please fill out this field.
eko: Mpriyeexheri niipuro ntthi

source: Please select a language to review sentences.
eko: Muthawule luuka moote para orutela yoona farazi.

source: [‘Raised’ in English is always pronounced as one syllable, not two]
eko: [‘Yaawo’ ni ezuku enttakhuliwa na harifu moote, kahiyo piiri]

source: Rate limit exceeded. Try again in { $retryLimit } minutes
eko: Zavikana okhupi zawinviyariwa. Mmananise theenya { $retryLimit } minuutu

source: Rate limit exceeded. Try again in { $retryLimit } seconds
eko: Zavikana okhupi zawinviyariwa. Mmananise theenya { $retryLimit } sekuntu

source: Reader Effects
eko: Soorettikhana yanamasoma

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
eko: Mattakhuzi apale ansomiwaye ahiri nwarakha, nkhama "n laati" olikha yoori "maati" wala waza yawixela khuteela kiina.

source: Read Sentences
eko: Osoma farazi

source: Read Sentences, Answer Questions
eko: Osoma farazi, ocipu zawuzeliwa

source: Read Sentences <small>(Coming soon)</small>
eko: Osoma farazi <small>(Nasaapi)</small>

source: Read sentences submitted by the community in various languages
eko: Osoma farazi zitiisiwe okomunitaati na luuka zawaatta

source: Ready to do { $count } more?
eko: Karaatiwa oretta zikina { $count }?

source: <recordIcon></recordIcon> Last one!
eko: <recordIcon></recordIcon> Wiixhela!

source: [Recording cut off before the end of the last word]
eko: [Karavasayu yeetta olikheleliwa ehinafyiye ehinaze wiixa nttakhuzi nawiixela]

source: Record/Stop
eko: Okaravari/ Yeemela

source: Record yourself reading sentences in your language
eko: Ocikaravari nsomaka farazi na luuka yenu

source: Record yourself responding to questions and prompts in your language
eko: Ocikaravari ncipwaka zahuzeliwa ni zoohicuwehi saana mweepile ziri luuka yenu

source: Record your voice
eko: Nkaravari huula yeenu

source: Reference the source of your sentence (required)
eko: Mulupe vahali muzikaniyeezo farazi yeeno (opirikatoriyu)

source: Reject
eko: Okathala

source: Report
eko: Wuuza

source: Report was passed successfully
eko: Khaazi yaperekhiwa saana

source: Request a Language
eko: Nveke luuka

source: Re-record
eko: Orutela okaravari

source: Re-record clip
eko: Orutela okaravari vitiyu

source: Return
eko: Orutela

source: Review
eko: Orutela woona

source: Review and vote for new questions submitted by the community
eko: Nruttele osoma ni moone thennya zahuzela zitisiwe okomutitaati

source: Review could not be saved. Please try again later.
eko: Ohipwehe epile ooruteliyeeyo woona. Omananise woora nkina,

source: ⓘ Review Criteria
eko: Tarikhi zooxapweya ovira yoori murutele woona

source: Review Criteria
eko: Tarikhi zooxapweya ovira yoori murutele woona

source: Reviewed sentences not submitted, are sure?
eko: Farazi soorutela woona khazinviyariweeni, mwakhupali?

source: Review existing sentences submitted by the community
eko: Nrutele osoma farazi eriivo ziiviyariwe okomunitaati

source: Review questions
eko: Nruttele osoma zawuuzeliya

source: Review & re-record clips here as you go
eko: Nrutele osoma ni ikaravari farazi ni murette nvikanaka

source: Review & re-record clips if needed
eko: Mwirutele osoma, ni mmana ntakha nrutele nkaravari farazi

source: Review sentences
eko: Nrutele osoma farazi za luuka yeenu

source: Review Sentences
eko: Orutela woona farasi

source: Review & Submit
eko: Nrevizari ni mwiiviyari

source: Review transcriptions of recorded sentences for accuracy
eko: Oruttela woona saaneene saawatikhiwa farazi zookaravariwa

source: Review user-submitted transcriptions in your language
eko: Oruttela woona zawaattikhiwa sookaravariwa ni atthu na luuka saya

source: s
eko: g

source: S
eko: P

source: Select an option
eko: Nthawule opusaayu mmote

source: Select a variant (optional)
eko: Muthawule luuka moote (yoothawuleya)

source: Select File
eko: Onthawula arkivu

source: Select File to Upload
eko: Muuthawule arkivu para omwinviyari

source: Select up to three domains (optional)
eko: Muthawule mpakha tominiyu ttatthu

source: Sentence
eko: Farazi

source: Sentence Domain
eko: Tominiyu wa farazi
